src/Catalogs/FL_Messages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>FL_Messages</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AppId</Name>
					<Comment>Identifier of the application that produced the message.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentEncoding</Name>
					<Comment>Message content encoding.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentType</Name>
					<Comment>Message content type.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrelationId</Name>
					<Comment>Message correlated to this one.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EventSource</Name>
					<Comment>Provides access to the event source object name.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Operation</Name>
					<Comment>The type of change experienced.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FL_Operations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplyTo</Name>
					<Comment>Resource name other apps should send the response to.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Routed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Timestamp</Name>
					<Comment>Timestamp of the moment when message was created.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserId</Name>
					<Comment>User id.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Context</Name>
					<Comment>Serialized invocation data into XML. </Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Filter</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NamespaceURI</Name>
							<Comment>URI of the name space, to which the XML type belongs.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PrimaryKey</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TypeName</Name>
							<Comment>A representation XML data type by XML type name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>XMLValue</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AppEndpoints</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Endpoint</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Exchange</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Exchanges</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Job</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Jobs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Exchanges</Name>
					<Comment>List of exchanges.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Exchange</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Exchanges</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Job</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Jobs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SessionContext</Name>
					<Comment>Provides access to the runtime session context.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>MetadataObject</Name>
							<Comment>Provides access to the metadata object name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Session</Name>
							<Comment>Semi-permanent interactive information interchange.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ValueStorage</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/FL_Messages/Forms/ItemForm/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// This file is part of FoxyLink.
// Copyright © 2016-2019 Petro Bazeliuk.
// 
// This program is free software: you can redistribute it and/or modify 
// it under the terms of the GNU Affero General Public License as 
// published by the Free Software Foundation, either version 3 of the License,
// or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful, 
// but WITHOUT ANY WARRANTY; without even the implied warranty of 
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
// GNU Affero General Public License for more details.
//
// You should have received a copy of the GNU Affero General Public License 
// along with FoxyLink. If not, see <http://www.gnu.org/licenses/agpl-3.0>.
//
////////////////////////////////////////////////////////////////////////////////

#Region Variables

&AtClient
Var ContextPollOptions;

&AtClient
Var RoutesPollOptions;

#EndRegion // Variables

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
    
    MessageId = XMLString(Object.Ref);    
    
EndProcedure // OnCreateAtServer() 

&AtClient
Procedure OnOpen(Cancel)
    
    LoadContextData();
    TimestampToDate();
    
EndProcedure // OnOpen()

#EndRegion // FormEventHandlers

#Region FormItemsEventHandlers

&AtClient
Procedure ContextSelection(Item, SelectedRow, Field, StandardProcessing)
    
    CurrentData = Item.CurrentData;
    If CurrentData = Undefined Then
        Return;
    EndIf;
    
    If Field.Name = "ContextValue" Then
        ShowValue(, CurrentData.Value);     
    EndIf;
    
EndProcedure // ContextSelection()

&AtClient
Procedure PropTimestampOnChange(Item)
    
    TimestampToDate();
    
EndProcedure // PropTimestampOnChange()

#EndRegion // FormItemsEventHandlers

#Region FormCommandHandlers

&AtClient
Procedure CancelLoadingContext(Command)

    If TypeOf(ContextTaskResult) = Type("Structure") 
        AND ContextTaskResult.Property("TaskId") Then 
        StopBackgroundJob(ContextTaskResult.TaskId);
        AfterContextTaskComplete();
    EndIf;
    
EndProcedure // CancelLoadingContext()

#EndRegion // FormCommandHandlers

#Region ServiceProceduresAndFunctions

// Loads a message context data into this form.
//
&AtClient
Procedure LoadContextData()
    
    Items.ContextPages.CurrentPage = Items.ContextLoadingPage;
    AttachIdleHandler("Attachable_LoadContextData", 0.2, True);   
    
EndProcedure // LoadContextData()

// Converts timestamp to a local date string.
//
&AtClient
Procedure TimestampToDate() 
    
    Items.Timestamp.Title = FL_CommonUseClientServer.TimestampToLocalDateString(
        Object.Timestamp);   
    
EndProcedure // TimestampToDate() 

#Region AttachableAndNotifyProceduresAndFunctions

&AtClient
Procedure Attachable_CheckLoadContextData()

    UpdateTaskResult(ContextTaskResult);
    
    If ContextTaskResult.State = "Completed" Then
        AfterContextTaskComplete();
    Else
        FL_TasksClientServer.UpdatePollInterval(ContextPollOptions);
        AttachIdleHandler("Attachable_CheckLoadContextData", 
            ContextPollOptions.PollInterval, True); 
    EndIf;
    
EndProcedure // Attachable_CheckLoadContextData()

&AtClient
Procedure Attachable_LoadContextData()
    
    FillContextDataInBackground();
    
    If ContextTaskResult.State = "Completed" Then
        AfterContextTaskComplete();
    Else
        ContextPollOptions = FL_TasksClientServer.NewPollOptions();    
        AttachIdleHandler("Attachable_CheckLoadContextData", 
            ContextPollOptions.PollInterval, True);
    EndIf;
    
EndProcedure // Attachable_LoadContextData()

&AtServer
Procedure FillContextDataInBackground()
    
    Task = FL_TasksClientServer.NewTask();
    Task.Context = UUID;
    Task.MethodName = "Catalogs.FL_Messages.NewInvocationFromMessage";
    Task.Parameters.Add(Object.Ref);
    ContextTaskResult = FL_Tasks.Run(Task);
                                 
EndProcedure // FillContextDataInBackground()

#EndRegion // AttachableAndNotifyProceduresAndFunctions

#Region TaskHandlers

&AtServer
Procedure AfterContextTaskComplete()
    
    If IsTempStorageURL(ContextTaskResult.StorageAddress) Then
        
        Invocation = GetFromTempStorage(ContextTaskResult.StorageAddress);
        If TypeOf(Invocation) = Type("Structure") Then
            Context.Load(Invocation.Context);
        EndIf;
        
    EndIf;

    Items.ContextPages.CurrentPage = Items.ContextPage;
    
EndProcedure // AfterContextTaskComplete()

&AtServerNoContext
Procedure UpdateTaskResult(TaskResults)
    FL_Tasks.UpdateTaskResult(TaskResults);
EndProcedure // UpdateTaskResult()

&AtServerNoContext
Procedure StopBackgroundJob(UUID)
    FL_JobServer.StopBackgroundJob(UUID);
EndProcedure // StopBackgroundJob()

#EndRegion // TaskHandlers 

#EndRegion // ServiceProceduresAndFunctions
